In [1]:
import pandas as pd

In [17]:
v = pd.Series(data = [10,20,30,40], index=['A', "B","C","D"])

In [18]:
v

A    10
B    20
C    30
D    40
dtype: int64

In [19]:
type(v)

pandas.core.series.Series

In [20]:
# v = pd.DataFrame(v)
# v

In [21]:
# type(v)

In [22]:
v['B']

20

In [24]:
v.shape

(4,)

In [25]:
v.ndim

1

In [26]:
v.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [27]:
v.values

array([10, 20, 30, 40], dtype=int64)

In [30]:
v['A':'D':3]

A    10
D    40
dtype: int64

In [31]:
import pandas as pd

In [32]:
#create a dataFrame using Dataframe
df = pd.DataFrame({ "Name":['Tom',"Jelly","Chotta Vim",'Monkey'], "Age" :['20',40,12,56]})
df

         Name Age
0         Tom  20
1       Jelly  40
2  Chotta Vim  12
3      Monkey  56

#### METHOD 1 :) 
TO CHANGE THE COLUMNS AND ROW NAMES USING [DF.COLUMNS & DF.ROWS]

In [33]:
#Changing the columns name
df.columns = ['Col_1','Col_2']
df

        Col_1 Col_2
0         Tom    20
1       Jelly    40
2  Chotta Vim    12
3      Monkey    56

In [34]:
# Changing the row name
df.index = ['a','b','c','d']
df

        Col_1 Col_2
a         Tom    20
b       Jelly    40
c  Chotta Vim    12
d      Monkey    56

#### METHOD 2 :) TO CHANGE NAME USING [DF.RENAME()]

In [35]:
# Change a single columns name.
df = df.rename(columns= {'Col_1':"name..."})
df

      name... Col_2
a         Tom    20
b       Jelly    40
c  Chotta Vim    12
d      Monkey    56

In [36]:
df = df.rename({'b':"No name"})
df

            name... Col_2
a               Tom    20
No name       Jelly    40
c        Chotta Vim    12
d            Monkey    56

## ----------------------------------------------------------------

### Read dataset of Bitcoin Price (2014-2023)

In [37]:
import pandas as pd

In [38]:
ls

 Volume in drive E is Aritra
 Volume Serial Number is 864D-ACBB

 Directory of e:\University Ofiicial\3RD YEAR\5th Sem\AILABS JOURNEY\Practice_Ignore

24-07-2023  12:40 AM    <DIR>          .
23-07-2023  08:08 PM    <DIR>          ..
23-07-2023  09:48 PM           266,498 BTC-USD.csv
03-07-2023  09:34 PM             9,435 Day 2 Practice.ipynb
24-07-2023  08:17 PM            10,705 Pandas_Practice.ipynb
               3 File(s)        286,638 bytes
               2 Dir(s)  530,639,495,168 bytes free

In [39]:
ds = pd.read_csv('BTC-USD.csv')

In [40]:
ds.head(2)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,34483200

In [41]:
# read the data from give the full location of the directory.
pd.read_csv(r'e:\University Ofiicial\3RD YEAR\5th Sem\AILABS JOURNEY\Practice_Ignore\BTC-USD.csv').head(1)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800

In [42]:
# header (CHANGE THE COLUMNS NAME TO INTEGER VALUES.)
pd.read_csv('BTC-USD.csv',header = None).head(1)

      0     1     2    3      4          5       6
0  Date  Open  High  Low  Close  Adj Close  Volume

In [43]:
#CHANGE THE COLMNS NAME BY USER CHOICE.
pd.read_csv("BTC-USD.csv", names= ['a','b','c','d','e','f','g']).head(1)

      a     b     c    d      e          f       g
0  Date  Open  High  Low  Close  Adj Close  Volume

In [44]:
# remove some columns value name and see what it is occurs error or run satisfiactory...
pd.read_csv("BTC-USD.csv", names= ['d','e','f']).head(1)

                        d          e       f
Date Open High Low  Close  Adj Close  Volume

In [46]:
# remove some columns value name and see what it is occurs error or run satisfiactory...
pd.read_csv("BTC-USD.csv", names= ['d','f','g']).head(1)

                        d          f       g
Date Open High Low  Close  Adj Close  Volume

In [53]:
# Hide the columns name.
pd.read_csv("BTC-USD.csv", names= []).head(1)

Empty DataFrame
Columns: []
Index: [(Date, Open, High, Low, Close, Adj Close, Volume)]

In [54]:
pd.read_csv("BTC-USD.csv", names= ['d','e','f']).index

MultiIndex([(      'Date',         'Open',         'High',          'Low'),
            ('2014-09-17',   '465.864014',   '468.174011',   '452.421997'),
            ('2014-09-18',   '456.859985',   '456.859985',   '413.104004'),
            ('2014-09-19',   '424.102997',   '427.834991',   '384.532013'),
            ('2014-09-20',   '394.673004',   '423.295990',   '389.882996'),
            ('2014-09-21',   '408.084991',   '412.425995',   '393.181000'),
            ('2014-09-22',   '399.100006',   '406.915985',   '397.130005'),
            ('2014-09-23',   '402.092010',   '441.557007',   '396.196991'),
            ('2014-09-24',   '435.751007',   '436.112000',   '421.131989'),
            ('2014-09-25',   '423.156006',   '423.519989',   '409.467987'),
            ...
            ('2023-07-10', '30172.423828', '31026.083984', '29985.394531'),
            ('2023-07-11', '30417.632813', '30788.314453', '30358.097656'),
            ('2023-07-12', '30622.246094', '30959.964844', '30228.835938'),
            ('2023-07-13', '30387.488281', '31814.515625', '30268.351563'),
            ('2023-07-14', '31474.720703', '31582.253906', '29966.386719'),
            ('2023-07-15', '30331.783203', '30407.781250', '30263.462891'),
            ('2023-07-16', '30297.472656', '30437.560547', '30089.669922'),
            ('2023-07-17', '30249.626953', '30336.400391', '29685.783203'),
            ('2023-07-18', '30147.070313', '30233.656250', '29556.427734'),
            ('2023-07-20', '29919.064453', '30224.115234', '29918.281250')],
           length=3229)

In [55]:
df = pd.read_csv("BTC-USD.csv", names= ['a','b','c','d','e','f','g'])
df[1:0]['a']

Series([], Name: a, dtype: object)

In [56]:
df = pd.read_csv("BTC-USD.csv", names= ['a','b','c','d','e','f','g'])
df[0:0]['d']

Series([], Name: d, dtype: object)

In [57]:
df.head(10)['a']

0          Date
1    2014-09-17
2    2014-09-18
3    2014-09-19
4    2014-09-20
5    2014-09-21
6    2014-09-22
7    2014-09-23
8    2014-09-24
9    2014-09-25
Name: a, dtype: object

In [62]:
df = pd.read_csv("BTC-USD.csv", names= ['a','b','c','d','e','f','g'])
df[0:5]['a']
#here a is the columns name and [0:] => 0 is the startig index and [:3] => 3 is the ending index

0          Date
1    2014-09-17
2    2014-09-18
3    2014-09-19
4    2014-09-20
Name: a, dtype: object

In [64]:
df[0:5][{'a','b','c'}] #here it print the columns in reverse or random because - Passing a set as an indexer... Use a "LIST" instead.

C:\Users\Aritra_Offficial\AppData\Local\Temp\ipykernel_12904\567783040.py:1: FutureWarning: Passing a set as an indexer is deprecated and will raise in a future version. Use a list instead.
  df[0:5][{'a','b','c'}] #here it print the columns in reverse or random because - Passing a set as an indexer... Use a "LIST" instead.

            b           a           c
0        Open        Date        High
1  465.864014  2014-09-17  468.174011
2  456.859985  2014-09-18  456.859985
3  424.102997  2014-09-19  427.834991
4  394.673004  2014-09-20  423.295990

In [66]:
df[0:5][['a','b','c']]

            a           b           c
0        Date        Open        High
1  2014-09-17  465.864014  468.174011
2  2014-09-18  456.859985  456.859985
3  2014-09-19  424.102997  427.834991
4  2014-09-20  394.673004  423.295990

In [65]:
df.head(2)[['a','b','c']]

            a           b           c
0        Date        Open        High
1  2014-09-17  465.864014  468.174011

In [67]:
df.index

RangeIndex(start=0, stop=3229, step=1)

In [79]:
df = pd.read_csv("BTC-USD.csv", names= ['c_a','c_b','c_c','c_d','c_e','c_f','c_g'])
df.head(5)

,c_a,c_b,c_c,c_d,c_e,c_f,c_g
0,Date,Open,High,Low,Close,Adj Close,Volume
1,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800
2,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,34483200
3,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,37919700
4,2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,36863600

In [80]:
df = df.rename({0:'Apple', 1:'Bird', 2:'Cat',3:'Dog'}) 
df.head(4)

,c_a,c_b,c_c,c_d,c_e,c_f,c_g
Apple,Date,Open,High,Low,Close,Adj Close,Volume
Bird,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800
Cat,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,34483200
Dog,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,37919700

In [75]:
df.loc

In [76]:
df.loc['Bird']

c_a    2014-09-17
c_b    465.864014
c_c    468.174011
c_d    452.421997
c_e    457.334015
c_f    457.334015
c_g      21056800
Name: Bird, dtype: object

In [82]:
df.loc['Cat']

c_a    2014-09-18
c_b    456.859985
c_c    456.859985
c_d    413.104004
c_e    424.440002
c_f    424.440002
c_g      34483200
Name: Cat, dtype: object

In [83]:
df.dtypes

c_a    object
c_b    object
c_c    object
c_d    object
c_e    object
c_f    object
c_g    object
dtype: object

In [84]:
df.columns

Index(['c_a', 'c_b', 'c_c', 'c_d', 'c_e', 'c_f', 'c_g'], dtype='object')

In [85]:
df[['c_a','c_b']][1:3]

             c_a         c_b
Bird  2014-09-17  465.864014
Cat   2014-09-18  456.859985

In [86]:
len(df)

3229

# ____________________________________________________________________________

Read another dataset and find some another function.

In [97]:
wc = pd.read_csv("weather_city_deleted.csv")
wc

           day      city  temperature  windspeed   event
0   01-01-2017  new york         32.0          6    Rain
1   01-02-2017  new york         36.0          7   Sunny
2   01-03-2017  new york          NaN         12    Snow
3   01-04-2017      n.a.          NaN          7     NaN
4   01-01-2017    mumbai          NaN          5   Sunny
5   01-02-2017    mumbai         85.0       -999     Fog
6   01-03-2017    mumbai          NaN         15     Fog
7   01-04-2017    mumbai         92.0          5    Rain
8   01-01-2017     paris         45.0         20   Sunny
9   01-02-2017     paris         50.0         13  Cloudy
10  01-03-2017     paris         54.0          8     NaN
11  01-04-2017     paris         42.0      -2536  Cloudy

In [102]:
wc[3:4]['city']

3    NaN
Name: city, dtype: object

In [120]:
# make all the ["na values"] NAN
wc = pd.read_csv("weather_city_deleted.csv" , na_values=['n.a.'])
wc

           day      city  temperature  windspeed   event
0   01-01-2017  new york         32.0          6    Rain
1   01-02-2017  new york         36.0          7   Sunny
2   01-03-2017  new york          NaN         12    Snow
3   01-04-2017       NaN          NaN          7     NaN
4   01-01-2017    mumbai          NaN          5   Sunny
5   01-02-2017    mumbai         85.0       -999     Fog
6   01-03-2017    mumbai          NaN         15     Fog
7   01-04-2017    mumbai         92.0          5    Rain
8   01-01-2017     paris         45.0         20   Sunny
9   01-02-2017     paris         50.0         13  Cloudy
10  01-03-2017     paris         54.0          8     NaN
11  01-04-2017     paris         42.0      -2536  Cloudy

In [121]:
wc[3:4]['city']

3    NaN
Name: city, dtype: object

In [122]:
wc['city']

0     new york
1     new york
2     new york
3          NaN
4       mumbai
5       mumbai
6       mumbai
7       mumbai
8        paris
9        paris
10       paris
11       paris
Name: city, dtype: object

In [123]:
df = wc.city
df

0     new york
1     new york
2     new york
3          NaN
4       mumbai
5       mumbai
6       mumbai
7       mumbai
8        paris
9        paris
10       paris
11       paris
Name: city, dtype: object

In [124]:
df.loc[2]

'new york'

In [125]:
df.iloc[[1,3]]

1    new york
3         NaN
Name: city, dtype: object

In [127]:
wc

           day      city  temperature  windspeed   event
0   01-01-2017  new york         32.0          6    Rain
1   01-02-2017  new york         36.0          7   Sunny
2   01-03-2017  new york          NaN         12    Snow
3   01-04-2017       NaN          NaN          7     NaN
4   01-01-2017    mumbai          NaN          5   Sunny
5   01-02-2017    mumbai         85.0       -999     Fog
6   01-03-2017    mumbai          NaN         15     Fog
7   01-04-2017    mumbai         92.0          5    Rain
8   01-01-2017     paris         45.0         20   Sunny
9   01-02-2017     paris         50.0         13  Cloudy
10  01-03-2017     paris         54.0          8     NaN
11  01-04-2017     paris         42.0      -2536  Cloudy

In [128]:
# remove nan values and add some values.
wc = pd.read_csv("weather_city_deleted.csv" , na_values=['Aritra..'])
wc

           day      city  temperature  windspeed   event
0   01-01-2017  new york         32.0          6    Rain
1   01-02-2017  new york         36.0          7   Sunny
2   01-03-2017  new york          NaN         12    Snow
3   01-04-2017      n.a.          NaN          7     NaN
4   01-01-2017    mumbai          NaN          5   Sunny
5   01-02-2017    mumbai         85.0       -999     Fog
6   01-03-2017    mumbai          NaN         15     Fog
7   01-04-2017    mumbai         92.0          5    Rain
8   01-01-2017     paris         45.0         20   Sunny
9   01-02-2017     paris         50.0         13  Cloudy
10  01-03-2017     paris         54.0          8     NaN
11  01-04-2017     paris         42.0      -2536  Cloudy